
## Plan Result (management)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2266765683)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.terraform-backend.module.s3-bucket.aws_s3_bucket_acl.this
* Update
  * module.terraform-backend.module.s3-bucket.aws_s3_bucket.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.terraform-backend.module.s3-bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
      + force_destroy               = false
        id                          = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
        tags                        = {}
      ~ tags_all                    = {
          + "pl:environment" = "management"
          + "pl:iac"         = "terraform"
          + "pl:owner"       = "tqer39+aws-management@gmail.com"
          + "pl:product"     = "private-lab"
          + "pl:repository"  = "tqer39/private-lab"
          + "pl:source_path" = "terraform/environments/management/base"
        }
        # (8 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.terraform-backend.module.s3-bucket.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "terraform-tfstate-tqer39-577523824419-ap-northeast-1"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.terraform-backend.module.s3-bucket.aws_s3_bucket.this,
  on ../../../modules/s3/terraform-backend/main.tf line 1, in resource "aws_s3_bucket" "this":
   1: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_versioning resource instead

(and one more similar warning elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":9,"Program":"tfcmt","SHA1":"30f273ee945496d28d463564b4aa192eb3c58e68","Target":"management","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->